// 1. เรียกใช้งาน Module ที่ชื่อว่า 'http' ซึ่งเป็นระบบพื้นฐานของ Node.js สําหรับทําเซิรฟ์ เวอร์
const http = require('http');

// 2. กําหนดช่องทาง (Port) ที่เซิร์ฟเวอร์จะใช้สื่อสาร โดยให้ใช้ของที่ Cloud กําหนดมา
(process.env.PORT) ถ้าไม่มีให้ใช้ 3000
const port = process.env.PORT || 3000;

// 3. สร้างเครื่องแม่ข่าย (Server) ที่คอยรับคําขอ (req) และตอบกลับ (res)
const server = http.createServer((req, res) => {

// 3.1 ตั้งรหัสสถานะ 200 หมายถึง "ทํางานสําเร็จ (OK)"
res.statusCode = 200;

// 3.2 บอกเบราว์เซอร์ของผู้ใช้ว่า สิ่งที่สองกลับไปคือไฟล์ข้อความแบบ HTML และรองรับ
ภาษาไทย (utf-8)
res.setHeader('Content-Type', 'text/html; charset=utf-8');

// 3.3 สองข้อมูลหน้าเว็บกลับไปหาผู้ใช้ (*** ให้นักศึกษาแก้ชื่อ-นามสกุลตรงนี้ ***)
res.end('<h1>สวัสดีจร้าาาา! นี่คือ Web Server ของ [นางสาวณัฐชา พิมพ์ทวด 69319010047]</h1><p>เครื่องแม่ข่ายทํางานปกติบนระบบ Railway แล้วค่ะ!</p>');
});

// 4. สั่งให้เซิร์ฟเวอร์เริ่มตอนเปิดรับฟังการเชื่อมต่อตาม Port ที่กําหนดไว้
server.listen(port, () => {
console.log(`Server is running! เครื่องแม่ข่ายเปิดทํางานแล้วที่ช่องทาง: ${port}`);
});
